#include <iostream>
#include <cmath>
#include <set>
#include <vector> 

/*
«Сто лет одиночества» Габриэля Гарсиа Маркеса 1967
«451 градус по Фаренгейту» Рэя Брэдбери 1953
«Поющие в терновнике» Колина Маккалоу 1977
«Война и мир» Льва Толстого 1869
«Тихий Дон» Михаила Шолохова 1928
«Маленький принц» Антуана де Сент-Экзюпери 1943
«Гордость и предубеждение» Джейн Остин 1813
«Волшебник Изумрудного города» Александра Волкова 1939
«Над пропастью во ржи» Джерома Сэлинджера 1951
«Приключения Незнайки и его друзей» Николая Носова 1954
«Маленькие женщины» Луизы Мэй Олкотт 1868
/**/

int main() {
    std::vector <std::string> bibl;
    std::
}
