#include <iostream>
#include <cmath>
#include <set>
#include <vector>

/*
«Сто лет одиночества» Габриэля Гарсиа Маркесс
«451 градус по Фаренгейту» Рэя Брэдбери
«Поющие в терновнике» Колина Маккалоу
«Война и мир» Льва Толстого
«Тихий Дон» Михаила Шолохова
«Маленький принц» Антуана де Сент-Экзюпери
«Гордость и предубеждение» Джейн Остин
«Волшебник Изумрудного города» Александра Волкова
«Над пропастью во ржи» Джерома Сэлинджера
«Приключения Незнайки и его друзей» Николая Носова
«Маленькие женщины» Луизы Мэй Олкотт
/**/

int main() {
    std::vector <std::string> bibl;
    std::
}
