#include <iostream>
#include <cmath>
#include <set>
#include <vector>

/*
«Сто лет одиночества» Габриэля Гарсиа Маркеса; 12
«451 градус по Фаренгейту» Рэя Брэдбери; 2
«Поющие в терновнике» Колина Маккалоу; 2
«Война и мир» Льва Толстого; 2
«Тихий Дон» Михаила Шолохова; 12
«Маленький принц» Антуана де Сент-Экзюпери; 2
«Гордость и предубеждение» Джейн Остин; 12
«Волшебник Изумрудного города» Александра Волкова; 2
«Над пропастью во ржи» Джерома Сэлинджера; 12
«Приключения Незнайки и его друзей» Николая Носова; 2
«Маленькие женщины» Луизы Мэй Олкотт. 
/**/

int main() {
    std::vector <std::string> bibl;
    std::
}
